sprint3/standups.tex
% Created 2020-04-03 Fri 00:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fourier}
\author{LC7: Eduard, Tash, Tomin, Jordan}
\date{\today}
\title{Daily Stand-ups for Sprint 3}
\hypersetup{
 pdfauthor={LC7: Eduard, Tash, Tomin, Jordan},
 pdftitle={Daily Stand-ups for Sprint 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Original plans}
\label{sec:orgad1d36e}
Before the while COVID-19 issue came up, we had a few ideas of what we
wanted to do for sprint 3 which are as follow:

\begin{itemize}
\item Do PIC16 capacities buttons (circuits and software).
\item Learn how to interface PIC16 to SD card (PIC lab maybe?).
\item Look into how we should buffer audio to the DAC.
\begin{itemize}
\item Research PIC interrupts to pause DAC writes.
\end{itemize}
\item Write basic music playback for the PIC.

We estimated that this would be about 20 hours of work.
\end{itemize}
\section*{Stand-up logs}
\label{sec:org9a7cf77}
\emph{Note: we have been doing our stand-ups every Monday and Wednesday (and sometimes Friday) due to difficulties meeting.}
\section*{Wednesday March 18}
\label{sec:org20969f6}
\begin{itemize}
\item We discussed pretty much nothing critical. Decided to hold off doing anything for the time-being.
\item Eduard said we would pick up the PIC16 stuff.
\end{itemize}
\section*{Friday March 20}
\label{sec:org8fd7197}
\begin{itemize}
\item This was the first opportunity for us to meet as a group during ENEL 300
\item New course details mean we do not need a physical prototype, so we are throwing out most our plans for this sprint.
\begin{itemize}
\item We will no longer buy any parts.
\end{itemize}
\item Talked about alternative methods of d emonstrating our project.
-\textbf{Verdict:} We have a C prototype, but it lacks the polish that
we want, so for this sprint we will look into methods of simulating
our product virtually as Eduard has recommended. [Assigned to
all; estimated time \textasciitilde{}1.5 hours]
\end{itemize}
\section*{Monday March 23}
\label{sec:org36abb51}
\begin{itemize}
\item Quick meeting after 327 worksheets.
\item Talked about status of our project and what tasks our group can do.
-\textbf{Verdict:} Jordan and Tomin can do revised technical requirments [estimated time 1 hour]. Tash
can work on typesetting and writing the documents [estimated time < 1 hour].
\end{itemize}
\section*{Wednesday March 25}
\label{sec:orgc7e3cd3}
\begin{itemize}
\item Talked a little about our demo.
\item For simulation software there are a few different options, but 3 stand out:
\begin{enumerate}
\item GTK (hard)
\item nukler (hard)
\item QT (hard and only one of us know C++)
\item One of several audio programming languages.
\end{enumerate}
\item the GUI frameworks seem pretty obtuse, and none of us really want to learn a new
programming language. For know we will skip this part as it is not strictly required,
but may revisit it if time allows.
\end{itemize}
\section*{Friday March 27}
\label{sec:orgde39438}
\begin{itemize}
\item Discussed drawing schematics for key circuits in our ``imaginary'' design. No extra work 
really has to be done here, we just need to compile the diagrams that we have done for earlier
labs and stuff. [assigned to all; estimated time \textasciitilde{}1.5 hour]
\item We looked a bit more into the simulation aspect, and one possible part of this is designing our 
PC prototype to have a similar performance characteristics to the PIC platform - as in it should
be able to run on low-end hardware.
\end{itemize}
\section*{Monday March 30}
\label{sec:org659cd0b}
\begin{itemize}
\item Finished compiling circuit schematics, all that will need to be done next sprint is digitizing our
drawings. We also came up with the idea of providing sample software, but lack of access to hardware
by all may make that impossible.
\item Tomin and Jordan have finished the revised technical documentation, and will send it to Tash tonight.
\end{itemize}
\section*{Wednesday April 1}
\label{sec:org6adfe87}
\begin{itemize}
\item Very short meeting to clarify a few things.
\item Tash has finished compiling the documents, and Jordan can typeset it in \TeX{} and send it off
tomorrow.
\end{itemize}
\end{document}